{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "filters": 32, "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_4", "trainable": true, "kernel_size": [3, 3], "padding": "valid", "activation": "linear", "dtype": "float32", "dilation_rate": [1, 1], "batch_input_shape": [null, 250, 250, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 32, "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_5", "bias_regularizer": null, "padding": "valid", "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "strides": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_5", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_6", "bias_regularizer": null, "padding": "valid", "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "strides": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_6", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_3", "activation": "linear", "units": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_4", "activation": "linear", "units": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_10", "activation": "tanh", "trainable": true}}], "keras_version": "2.0.2", "backend": "tensorflow"}