{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "activity_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "batch_input_shape": [null, 250, 250, 3], "bias_regularizer": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "dtype": "float32", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "filters": 32, "bias_regularizer": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "filters": 64, "bias_regularizer": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 2}}], "keras_version": "2.0.2"}