{"config": [{"config": {"name": "conv2d_1", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 250, 250, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "filters": 32, "padding": "valid", "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "valid", "strides": [1, 1], "activation": "linear", "bias_constraint": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "valid", "strides": [1, 1], "activation": "linear", "bias_constraint": null, "filters": 64}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "units": 64, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "units": 1, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "tanh", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}