{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 32, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 250, 250, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dtype": "float32", "name": "conv2d_1", "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 32, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 64, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "sigmoid"}}], "keras_version": "2.0.2", "backend": "tensorflow"}